{
  "data": [
    {
      "name": "Submersible",
      "date": "Week 1",
      "credits": "<a href=\"https://lynkolight.gumroad.com/l/fabiz?layout=profile\" target=\"_blank\"> UE5:Underwater Blueprint V2</a>, other assets from Quixel MegaScans",
      "description": [
        {
          "header": "Description",
          "text": "The visuals involve a character falling from the sky and landing underwater. While underwater, the character is surrounded by oceanic rocks and flora. An infinite expansive ocean is an image I keep coming back to, as it helps me convey feelings of isolation, absence, and disorientation. This feeling/vision of being underwater further adds another dimension of distance, with a whole alien world and no words to communicate with. Using the fast blurred motion and low angle of the camera I aimed to add to the disorientation."
        },
        {
          "header": "Debrief",
          "text": "Knowing I wanted to create an underwater scene, I started looking for ways to do it. I came across a blueprint (linked in credits) that generates beautiful oceans effortlessly. Using this as a stepping point, I started creating massive monolithic stone landscapes using Quixel Bridge and then added vibrant flora to add to the alienness of the scene. Hardware issues kept bogging me down and I wasn’t able to do everything I had set out to do. I was aiming to add oceanic alien fauna as well and then some more ethereal lighting and underwater fog. Given more time, I would aim to create ephemeral ruins in the ocean too."
        }
      ],
      "media": [
        {
          "link": "https://www.youtube.com/embed/KpMbYXyYs5c?si=5RWEdS72BaYyKItM",
          "type": "video",
          "caption": "Final render"
        },
        {
          "link": "https://i.imgur.com/7FoOObT.png",
          "type": "image",
          "caption": "Still 1"
        },
        {
          "link": "https://www.youtube.com/embed/GE8DRJAdHE0?si=DEA03UiwzCpKIPnn",
          "type": "video",
          "caption": "Performance Song"
        },
        {
          "link": "https://i.imgur.com/t3M83Jv.png",
          "type": "image",
          "caption": "Still 2"
        }
      ]
    }
  ]
}
